### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault.kv has been deleted
-   resource "azurerm_key_vault" "kv" {
-       access_policy                   = [] -> null
-       enable_rbac_authorization       = true -> null
-       enabled_for_deployment          = false -> null
-       enabled_for_disk_encryption     = true -> null
-       enabled_for_template_deployment = false -> null
-       id                              = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg/providers/Microsoft.KeyVault/vaults/pwd9000-inf-dev-kv767" -> null
-       location                        = "uksouth" -> null
-       name                            = "pwd9000-inf-dev-kv767" -> null
-       purge_protection_enabled        = false -> null
-       resource_group_name             = "Demo-Inf-Dev-Rg" -> null
-       sku_name                        = "standard" -> null
-       soft_delete_enabled             = true -> null
-       soft_delete_retention_days      = 7 -> null
-       tags                            = {
-           "Environment"         = "DEV"
-           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
-           "NewTag2"             = "last2"
-           "Tag1"                = "first1"
-           "terraformDeployment" = "true"
        } -> null
-       tenant_id                       = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2" -> null
-       vault_uri                       = "https://pwd9000-inf-dev-kv767.vault.azure.net/" -> null

-       network_acls {
-           bypass                     = "AzureServices" -> null
-           default_action             = "Allow" -> null
-           ip_rules                   = [] -> null
-           virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_resource_group.rg has been deleted
-   resource "azurerm_resource_group" "rg" {
-       id       = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/Demo-Inf-Dev-Rg" -> null
-       location = "uksouth" -> null
-       name     = "Demo-Inf-Dev-Rg" -> null
-       tags     = {
-           "Environment"         = "DEV"
-           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
-           "terraformDeployment" = "true"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_key_vault.kv will be created
+   resource "azurerm_key_vault" "kv" {
+       access_policy               = (known after apply)
+       enable_rbac_authorization   = true
+       enabled_for_disk_encryption = true
+       id                          = (known after apply)
+       location                    = "uksouth"
+       name                        = "pwd9000-inf-dev-kv767"
+       purge_protection_enabled    = false
+       resource_group_name         = "Demo-Inf-Dev-Rg"
+       sku_name                    = "standard"
+       soft_delete_enabled         = (known after apply)
+       soft_delete_retention_days  = 7
+       tags                        = {
+           "Environment"         = "DEV"
+           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
+           "terraformDeployment" = "true"
        }
+       tenant_id                   = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                   = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.rg will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Demo-Inf-Dev-Rg"
+       tags     = {
+           "Environment"         = "DEV"
+           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
+           "terraformDeployment" = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>